{
  "architectures": [
    "TorchTitanQwen3ForCausalLM"
  ],
  "model_type": "qwen3",
  "hidden_size": 3584,
  "intermediate_size": 18944,
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "vocab_size": 151936,
  "max_position_embeddings": 32768,
  "rope_theta": 1000000.0,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "head_dim": 128,
  "attention_bias": false,
  "hidden_act": "silu",
  "qk_norm": true,
  "torch_dtype": "bfloat16",
  "skip_tokenizer_init": true
}
