{
  "additional_special_tokens": [
    "[SYNONYM]",
    "[RELATED]",
    "[SIMILAR]",
    "[PROPERTY]",
    "[SAS]",
    "[WEIGHT]",
    "[TPSA]",
    "[CLOGP]",
    "[QED]",
    "[NUMHDONORS]",
    "[NUMHACCEPTORS]",
    "[NUMHETEROATOMS]",
    "[NUMROTATABLEBONDS]",
    "[NOCOUNT]",
    "[NHOHCOUNT]",
    "[RINGCOUNT]",
    "[HEAVYATOMCOUNT]",
    "[FRACTIONCSP3]",
    "[NUMAROMATICRINGS]",
    "[NUMSATURATEDRINGS]",
    "[NUMAROMATICHETEROCYCLES]",
    "[NUMAROMATICCARBOCYCLES]",
    "[NUMSATURATEDHETEROCYCLES]",
    "[NUMSATURATEDCARBOCYCLES]",
    "[NUMALIPHATICRINGS]",
    "[NUMALIPHATICHETEROCYCLES]",
    "[NUMALIPHATICCARBOCYCLES]",
    "[IUPAC]",
    "[VAR_NAME]",
    "[VAR_DESC]",
    "[VAR_VAL]",
    "[ASSAY_NAME]",
    "[ASSAY_DESC]",
    "[/SYNONYM]",
    "[/RELATED]",
    "[/SIMILAR]",
    "[/PROPERTY]",
    "[/SAS]",
    "[/WEIGHT]",
    "[/TPSA]",
    "[/CLOGP]",
    "[/QED]",
    "[/NUMHDONORS]",
    "[/NUMHACCEPTORS]",
    "[/NUMHETEROATOMS]",
    "[/NUMROTATABLEBONDS]",
    "[/NOCOUNT]",
    "[/NHOHCOUNT]",
    "[/RINGCOUNT]",
    "[/HEAVYATOMCOUNT]",
    "[/FRACTIONCSP3]",
    "[/NUMAROMATICRINGS]",
    "[/NUMSATURATEDRINGS]",
    "[/NUMAROMATICHETEROCYCLES]",
    "[/NUMAROMATICCARBOCYCLES]",
    "[/NUMSATURATEDHETEROCYCLES]",
    "[/NUMSATURATEDCARBOCYCLES]",
    "[/NUMALIPHATICRINGS]",
    "[/NUMALIPHATICHETEROCYCLES]",
    "[/NUMALIPHATICCARBOCYCLES]",
    "[/IUPAC]",
    "[/VAR_NAME]",
    "[/VAR_DESC]",
    "[/VAR_VAL]",
    "[/ASSAY_NAME]",
    "[/ASSAY_DESC]"
  ],
  "bos_token": {
    "content": "<s>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "</s>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<pad>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
